In [1]:
import pandas as pd

In [2]:
import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n",series)

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
##create Series from Dictonary
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [5]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [6]:
##DataFrame
data={
    'Name':['krish','John','Jack'],
    'Age' : [25,34,45],
    'City':['Bangalore','New York','Florida']

}
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  krish   25  Bangalore
1   John   34   New York
2   Jack   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [26]:
df['Name']

0    krish
1    krish
2    krish
3    krish
Name: Name, dtype: object

In [7]:
import numpy as np
np.array(df)

array([['krish', 25, 'Bangalore'],
       ['John', 34, 'New York'],
       ['Jack', 45, 'Florida']], dtype=object)

In [8]:
data=[
    {'Name':'krish','Age':32,'city':'Bangolore'},
    {'Name':'krish','Age':38,'city':'Bangolore'},
    {'Name':'krish','Age':34,'city':'Bangolore'},
    {'Name':'krish','Age':45,'city':'Bangolore'},
    
]
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       city
0  krish   32  Bangolore
1  krish   38  Bangolore
2  krish   34  Bangolore
3  krish   45  Bangolore
<class 'pandas.core.frame.DataFrame'>

In [12]:
##Ascending Data from dataframe
df

    Name  Age       city
0  krish   32  Bangolore
1  krish   38  Bangolore
2  krish   34  Bangolore
3  krish   45  Bangolore

In [13]:
type(df['Name'])

pandas.core.series.Series

In [14]:
df.at[2,'Age']

np.int64(34)

In [18]:
df.at[2,'Name']

'krish'

In [24]:
df

    Name  Age       city
0  krish   32  Bangolore
1  krish   38  Bangolore
2  krish   34  Bangolore
3  krish   45  Bangolore

In [31]:
##adding saalry coloumn
df['Salary']=[50000,60000,70000]
df

ValueError: Length of values (3) does not match length of index (4)

In [32]:
#Add age to the column
df['Age']=df['Age']+1
df

    Name  Age       city
0  krish   33  Bangolore
1  krish   39  Bangolore
2  krish   35  Bangolore
3  krish   46  Bangolore

In [34]:
df.drop(0,inplace=True)

In [35]:
df

    Name  Age       city
1  krish   39  Bangolore
2  krish   35  Bangolore
3  krish   46  Bangolore

In [36]:
#Display data types
print("Data types:\n", df.dtypes)

#Describe DaatFrame
print("Statistical summary:\n",df.describe())

Data types:
 Name    object
Age      int64
city    object
dtype: object
Statistical summary:
              Age
count   3.000000
mean   40.000000
std     5.567764
min    35.000000
25%    37.000000
50%    39.000000
75%    42.500000
max    46.000000

In [37]:
df.describe()

             Age
count   3.000000
mean   40.000000
std     5.567764
min    35.000000
25%    37.000000
50%    39.000000
75%    42.500000
max    46.000000